{"teacherName": " 李川", "gender": " 男", "title": " 教授", "lineage": " 计算机系", "mail": " **@qq.com", "phone": " **", "address": " 昆明理工大学信息工程与自动化学院", "educationalBackground": "  1993年毕业于云南大学物理系，获理学学士学位；1996年毕业于云南大学物理电子学专业，获理学硕士学位；2002年毕业于天津大学光学工程专业，获工学博士学位。", "researchDirection": "  科研方面，研制了各类传感器，申报了38项发明专利、60项实用新型专利，发展复杂工矿条件下的生产安全在线检测研究特色；利用测量电路、ARM嵌入式系统和PC计算机，建立了从检测信号到智能信息的检测仪表和数据处理中心，比如：FBG检测仪、OTDR分析仪等；建立了以光纤和无线为特色的传感网络系统；根据国家二等计量标准，从云南省计量研究院计量传递，建立温度计量、压力计量、水平台、角度块、长度块和电子万能试验机等平台。学科建设方面，依托机械学科和信息工程与自动化学院，2011年申报成功微机电系统二级学科博士点。作为首席教授，信息检测与处理创新团队的研究方向为：微光机电系统发展光纤和单光子、微光成像探测和非接触精密检测等技术与工程应用构成复杂工矿条件下的生产安全在线检测研究特色和检测平台；信号处理与传感网针对非平稳信号，分析噪声产生机理与主要噪声源，提高噪声线谱的分辨率及数据分析的不确定度；检测仪器与智能数据加工研究应用系统集成与智能化技术与方法，以被测对象的物理模型和信息模型为创新点，建立监测对象数据处理中心。", "profile": "李川 男，1971年生， 2002年毕业于天津大学光学工程专业，获工学博士学位。2002年9月18日，荣获2001年度的中国光学学会王大珩光学奖。2008年，被授予云南省学术与技术带头人。现在，他是昆明理工大学的教授，博士导师，信息检测与处理创新团队首席教授。社会兼职：中国光学学会理事，中国光电专业委员会委员，中国仪器仪表学会光机电技术与系统集成委员会常务理事，中国仪器仪表学会设备结构健康监测与预警分会理事，《昆明理工大学学报》编委。获云南省二等奖1项、三等奖1项、中国仪器仪表科技一等奖1项、教育部科技进步一等奖1项。出版专著2部。在国内外学术刊物及学术会议上发表第一作者或通信作者的学术论文101篇，其中SCI收录11篇，EI收录27篇。专利授权52项，发明专利7项，软件著作权15项。目前的主要研究方向为传感器的研制与检测应用。"}
{"teacherName": " 王清心", "gender": " 男 ", "title": " 教授", "lineage": " 计算机系", "mail": " yunnan403@sina.com", "phone": " ", "address": " 昆明理工大学", "educationalBackground": "  1976.07-1978.03 知青 辽宁省丹东市东沟县（东港市）长安公社1978.03-1982.01 在东北大学计算机科学与工程专业学习。1982年1月毕业于东北大学计算机科学与工程专业。", "researchDirection": "  WEB与数据库技术、软件工程、计算机网络集成技术、软件体系结构、计算机应用等。", "profile": "王清心 ，男，教授，1958年1月8日出生，研究方向 ：WEB与数据库技术。"}
{"teacherName": " 冯勇", "gender": " 男", "title": " 副教授", "lineage": " 计算机系", "mail": " fybraver@163.com", "phone": " ", "address": " 昆明理工大学信息工程与自动化学院", "educationalBackground": "  2011年6月毕业于电子科技大学计算机学院获工学博士学位。2007年6月毕业于云南大学信息学院获工学硕士学位。", "researchDirection": "  无线传感器网络、移动自组织网络、物联网", "profile": "冯勇，博士，副教授，昆明理工大学信息工程与自动化学院计算机科学与技术系、云南省计算机技术应用重点实验室教师。云南省高校普适与可信计算科技创新团队、昆明理工大学可信服务计算学科方向团队成员。2011年7月到昆明理工大学工作，担任硕士研究生导师。2012年破格晋升为副教授。主要研究领域为无线传感器网络、无线自组织网络及其安全，该领域为当前国内外学术界、产业界和各国政府高度关注并着力推进的新兴物联网技术中的核心研究领域。近年来作为负责人或主要研究人员进行了多项国家自然科学基金项目、国家“863计划”项目、省级科研项目的研究工作，取得了较好的研究成果，在国内外有影响力的学术期刊和会议上发表论文十余篇，其中以第一作者或通讯作者发表的论文被SCI检索5篇，被EI检索6篇。现主持科研项目2项，其中国家自然科学基金项目1项，省级科研项目1项。参与科研项目5项，其中国家自然科学基金项目2项，国家部委项目1项，省级科研项目2项。"}
{"teacherName": " 缪祥华", "gender": " 男", "title": " 副教授", "lineage": " 计算机系", "mail": " xianghuamiao@126.com", "phone": " ", "address": " 昆明理工大学信息工程与自动化学院", "educationalBackground": "  1994年毕业于西南师范大学计算机科学系计算机软件专业，获工学学士学位。1997年毕业于西南师范大学计算机科学系基础数学专业，获理学硕士学位。2006年6月毕业于西南交通大学信息科学与技术学院交通信息及控制专业，获工学博士学位。2006年11月至2009年6月在昆明理工大学矿业工程博士后流动站从事博士后研究工作，顺利完成在站期间的科研任务，获博士后证书。", "researchDirection": "  主要研究方向为信息安全、网络安全、移动通信安全。", "profile": "缪祥华，副教授，工学博士，博士后，中共党员。中国密码学会会员，中国密码学会昆明联系人，中国科技论文在线审稿专家，昆明理工大学学报审稿专家，云南民族大学学报审稿专家。1994年毕业于西南师范大学计算机科学系计算机软件专业，获工学学士学位。1997年毕业于西南师范大学计算机科学系基础数学专业，获理学硕士学位。2006年6月毕业于西南交通大学信息科学与技术学院交通信息及控制专业，研究方向为信息安全理论与技术，获工学博士学位。2006年11月至2009年6月在昆明理工大学矿业工程博士后流动站从事博士后研究工作，顺利完成在站期间的科研任务，获博士后证书。"}
{"teacherName": " 张智斌", "gender": " 男 ", "title": " 副教授", "lineage": " 计算机系", "mail": "  kmust.zhangzhibin@gmail.com", "phone": " ", "address": " 昆明理工大学信息工程与自动化学院", "educationalBackground": "  1987年毕业于重庆大学计算机软件专业，工学学士。", "researchDirection": "  主要研究领域为基于网络的计算机软件技术，工业控制技术等。", "profile": "张智斌，副教授。"}
{"teacherName": " 范洪博", "gender": " 男", "title": " 讲师", "lineage": " 计算机系", "mail": " **@qq.com", "phone": " **", "address": " ", "educationalBackground": "  98-02年，吉林大学，电子工程学院，电子学与信息系统专业，理学学士学位02-09年，黑龙江省绥化学院计算机系任教06-09年，哈尔滨工程大学，计算机科学与技术学院，计算机应用技术专业，工学硕士学位08-11年，哈尔滨工程大学，计算机科学于技术学院，计算机应用技术专业，工学博士学位12年至今，昆明理工大学信自院任教", "researchDirection": "  网络安全，算法优化，高性能串匹配算法，互联网金融", "profile": "范洪博，1982年10月生，博士，讲师。2012年到校工作，目前主持省自然基金面上项目一项，校基金一项，参加国家自然基金一项，在国内外期刊会议上发表EI论文10余篇，其中包括《计算机研究与发展》（国内计算机三大学报之一）2篇。校可信计算学科方向团队成员。先后授课十余门，主要集中在网络方面，总计超过2000学时。"}
{"teacherName": " 向凤红", "gender": " 男 ", "title": " 教授", "lineage": " 自动化系", "mail": " xiangfh5447@sina.com", "phone": " ", "address": " ", "educationalBackground": "  1997年9月获副教授任职资格，并被聘为硕士研究生导师至今。2002年9月通过矿物加工工程专业选矿厂自动化方向博士学位论文答辩，获工学博士学位。2002年10月获教授任职资格。2002年11月至2003年5月赴德国卡尔斯鲁厄大学进修。", "researchDirection": "  信息工程与自动化学院外聘硕士生导师1、智能控制理论与应用；2、计算机网络控制系统；3、基于（无线）传感器网络的信息融合与处理；4、先进控制技术及应用。", "profile": "2003年8月至2006年8月担任信息工程与自动化学院副院长。2006年8月至2012年7月担任信息工程与自动化学院院长。现担任昆明理工大学计算中心主任、中国自动化学会第九届理事会理事、中国自动化学会控制理论专业委员会委员、省高校第六届学术委员会委员、教育部高等学校自动化类专业教学指导委员会委员、云南省自动化学会副理事长、云南省电子工程高级工程师评审委员会委员、《自动控制原理》省级精品课程首席教授。1984年7月工作至今，先后讲授现代控制理论、自动控制原理、计算机控制系统、智能控制、最优控制、先进控制技术及应用等10余门研究生和本科生课程。先后主持或参加基于物联网的生产部QCD管理信息平台研究、异构无线传感执行器网络MAC协议不对称竞争接入控制算法研究、基于问题结构特性的混合差分进化调度理论与方法研究、复杂网络系统学科方向团队建设、专家系统在冶金炉窑控制中的应用、系统参数模糊神经元网络优化研究、基于网络集成自动化技术的能源监控管理系统、基于网络技术的递阶智能控制系统、制浆造纸计算机优化控制系统、生化反应过程适应性智能控制系统研究、《自动控制原理》省级精品课程建设等国家自然科学基金、省自然科学基金和校企合作科技开发项目30余项，发表各类科技期刊和学术会议论文70余篇，出版《自动控制原理》等教材4部，获得实用新型专利和软件著作权11项。先后获得省科技进步二等奖和三等奖各2次，省教学成果一等奖和二等奖各1次，省“优秀多媒体教育软件评审”一等奖1次，省优秀发明创造选拔赛二等奖1次。共指导控制理论与控制工程、检测技术与自动化装置、系统工程、测试计量技术与仪器、控制工程等专业硕士研究生59名。目前在研科研项目4项，在研项目总经费84万元。"}
{"teacherName": " 汪淑娟", "gender": " 女", "title": " 讲师", "lineage": " 自动化系", "mail": " shujuanwang0703@gmail.com", "phone": " ", "address": " 信自楼539 ", "educationalBackground": "  2007年毕业于北京交通大学生物医学工程专业，获工学学士学位。2013年毕业于北京交通大学信号与信息处理专业，获工学博士学位。2010年获国家留学基金委资助赴美国哥伦比亚大学访问一年。", "researchDirection": "  计算机网络通信，无线传输，网络编码，QoS等。", "profile": "以项目负责人身份完成了北京交通大学优秀博士生科技创新基金；参与并完成了国家高技术研究发展计划（“863”），国家重点基础研究发展计划（“973”）及横向项目等。在国际期刊及会议上发表SCI，EI论文十余篇，第一作者8篇。"}
